app/controllers/home_controller.rb

SELECT "users".* FROM "users"  ORDER BY "users"."id" ASC
---
	def getUsers
		@allUsers = User.get()