app/controllers/user_controller.rb

	def setUserAsChild
		parent = User.find_by(fb_id: params[:fb_id_parent])

		if !parent
			render json: {status: 'error', cause: 'parent not found'}
			return false
		else
			@newUser = setUser(params[:fb_id], params[:name])
			if @newUser
			   @newRelation = Relation.setRelation(parent.id, @newUser.id)
			   if @newRelation.save
---
SELECT  "users".* FROM "users" WHERE "users"."fb_id" = ? LIMIT 1  [["fb_id", "404587788785458"]]
INSERT INTO "relations" ("father", "son", "amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["father", 1], ["son", 2], ["amount", 0.0], ["created_at", "2015-04-23 04:16:48.308494"], ["updated_at", "2015-04-23 04:16:48.308494"]]
INSERT INTO "users" ("fb_id", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["fb_id", "4534534534534534"], ["name", "everitoSan"], ["created_at", "2015-04-23 04:16:48.300852"], ["updated_at", "2015-04-23 04:16:48.300852"]]