app/controllers/user_controller.rb

INSERT INTO "users" ("fb_id", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["fb_id", "4045877887458"], ["name", "everitoSan"], ["created_at", "2015-04-22 19:00:45.699832"], ["updated_at", "2015-04-22 19:00:45.699832"]]
---
	def setUser
		@curUser = User.set(params[:id_fb], params[:name])
		if @curUser.save